/** @type {import('tailwindcss').Config} */
module.exports = {
  content: [
    "./src/**/*.{js,jsx,ts,tsx}",
  ],
  theme: {
    extend: {
      width: {
        '128': '32rem', // 512 пикселей
        '160': '40rem', // 640 пикселей
        '192': '48rem', // 768 пикселей
        '256': '64rem', // 1024 пикселя
        '320': '80rem', // 1280 пикселей
      },
      height: {
        '128': '32rem', // 512 пикселей
        '160': '40rem', // 640 пикселей
        '192': '48rem', // 768 пикселей
        '256': '64rem', // 1024 пикселя
        '320': '80rem', // 1280 пикселей
      }
    },
  },
  plugins: [],
}